package tasks

/*
***Task 2:***

	***Напиши функцию для предварительного расчета ежемесячного дохода депозита в банке в зависимости от валюты, от суммы
	вклада (меньше 3000 мин ставка, больше макс ставка по соответствующей валюте), депозита в банке в зависимости от валюты
	(USD - min percent 7%/year, max percent 13%/year,
	EUR - min percent 9%/year, max percent 16%/year,
	RUB - min percent 6%/year, max percent 10%/year),
	есть  которым клиент хочет сделать вклад. Соответственно валидируй
	входные значения (сумма вклада, на сколько лет собирается сделать вклад), если не корректные данные, кидай ошибку,
	и в зависимости от входных значений рассчитай доход. Tут уже ты примерно знаешь как составить алгоритм, не сложная таска***

*/
